//Задача 64: Задайте значения M и N. Напишите программу, которая выведет все натуральные числа в промежутке от M до N.
//M = 1; N = 5. -> ""1, 2, 3, 4, 5""
//M = 4; N = 8. -> ""4, 6, 7, 8""

Console.Clear();

Console.Write("Введите число M: ");
int M = int.Parse(Console.ReadLine());
Console.Write("Введите число N: ");
int N = int.Parse(Console.ReadLine());
PrintNumber(M,N);

void PrintNumber(int x, int y)
{
    Console.Write($"{x},");
    if(x==y) return;
    else PrintNumber(x+1,y);
}



